Documents/РасписаниеАвтобусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>РасписаниеАвтобусов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Расписание</xr:Item>
				<xr:Item>InformationRegister.ЗанятостьСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Расписание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кондуктор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерМаршрута</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомерМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автобус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Транспорт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыезда</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПоездки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПриезда</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Занятость</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЗанятостьСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Расписание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>Расписание</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кондуктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автобус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Транспорт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомерМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗанятостьСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ЗанятостьСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Занятость</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЗанятостьСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/РасписаниеАвтобусов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Расписание 
	Движения.Расписание.Записывать = Истина;
	Для Каждого ТекСтрокаРасписание Из Расписание Цикл
		Движение = Движения.Расписание.Добавить();
		Движение.Период = Дата;
		Движение.Водитель = ТекСтрокаРасписание.Водитель;
		Движение.Кондуктор = ТекСтрокаРасписание.Кондуктор;
		Движение.Автобус = ТекСтрокаРасписание.Автобус;
		Движение.НомерМаршрута = ТекСтрокаРасписание.НомерМаршрута;
		Движение.ВремяВыезда = ТекСтрокаРасписание.ВремяВыезда;
	КонецЦикла;

	// регистр ЗанятостьСотрудников
	Движения.ЗанятостьСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаРасписание Из Расписание Цикл
		Движение = Движения.ЗанятостьСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаРасписание.Водитель;
		Движение.Занятость = ТекСтрокаРасписание.Занятость;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
